EI2030/Archer/firmware/ec/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_KSI0_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_KSI0_GPIO_PIN_MASK (1U << 0U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_KSI0_PORT 0U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_KSI0_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_KSI0_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PIO0_2 (number 81), KSI2
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_KSI2_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_KSI2_GPIO_PIN_MASK (1U << 2U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_KSI2_PORT 0U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_KSI2_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_KSI2_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PIO0_1 (number 7), KSI1
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_KSI1_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_KSI1_GPIO_PIN_MASK (1U << 1U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_KSI1_PORT 0U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_KSI1_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_KSI1_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PIO0_3 (number 83), KSI3
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_KSI3_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_KSI3_GPIO_PIN_MASK (1U << 3U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_KSI3_PORT 0U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_KSI3_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_KSI3_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PIO0_4 (number 86), KSI4
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_KSI4_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_KSI4_GPIO_PIN_MASK (1U << 4U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_KSI4_PORT 0U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_KSI4_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_KSI4_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PIO0_5 (number 88), KSI5
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_KSI5_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_KSI5_GPIO_PIN_MASK (1U << 5U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_KSI5_PORT 0U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_KSI5_PIN 5U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_KSI5_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PIO0_6 (number 89), KSI6
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_KSI6_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_KSI6_GPIO_PIN_MASK (1U << 6U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_KSI6_PORT 0U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_KSI6_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_KSI6_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PIO0_7 (number 6), KSI7
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_KSI7_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_KSI7_GPIO_PIN_MASK (1U << 7U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_KSI7_PORT 0U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_KSI7_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_KSI7_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PIO0_8 (number 26), PMIC_STBY_REQ
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_PMIC_STBY_REQ_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_PMIC_STBY_REQ_GPIO_PIN_MASK (1U << 8U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_PMIC_STBY_REQ_PORT 0U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_PMIC_STBY_REQ_PIN 8U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_PMIC_STBY_REQ_PIN_MASK (1U << 8U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PIO0_9 (number 55), PMIC_ON_REQ
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_PMIC_ON_REQ_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_PMIC_ON_REQ_GPIO_PIN_MASK (1U << 9U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_PMIC_ON_REQ_PORT 0U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_PMIC_ON_REQ_PIN 9U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_PMIC_ON_REQ_PIN_MASK (1U << 9U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PIO0_10 (number 21), LED
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_LED_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_LED_GPIO_PIN_MASK (1U << 10U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_LED_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_LED_PIN 10U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_LED_PIN_MASK (1U << 10U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PIO0_13 (number 71), SDA
  @{ */
#define BOARD_INITPINS_SDA_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SDA_PIN 13U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SDA_PIN_MASK (1U << 13U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PIO0_14 (number 72), SCL
  @{ */
#define BOARD_INITPINS_SCL_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SCL_PIN 14U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SCL_PIN_MASK (1U << 14U)      /*!<@brief PORT pin mask */
                                                     /* @} */

