EI2030/Archer/firmware/ec/board/pin_mux.h
/*! @name PIO0_15 (number 22), MPU_RST
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_MPU_RST_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_MPU_RST_GPIO_PIN_MASK (1U << 15U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_MPU_RST_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_MPU_RST_PIN 15U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_MPU_RST_PIN_MASK (1U << 15U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PIO0_18 (number 56), KSOS0
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_KSOS0_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_KSOS0_GPIO_PIN_MASK (1U << 18U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_KSOS0_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_KSOS0_PIN 18U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_KSOS0_PIN_MASK (1U << 18U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PIO0_19 (number 90), KSOS1
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_KSOS1_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_KSOS1_GPIO_PIN_MASK (1U << 19U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_KSOS1_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_KSOS1_PIN 19U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_KSOS1_PIN_MASK (1U << 19U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PIO0_20 (number 74), KSOS2
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_KSOS2_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_KSOS2_GPIO_PIN_MASK (1U << 20U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_KSOS2_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_KSOS2_PIN 20U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_KSOS2_PIN_MASK (1U << 20U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PIO0_21 (number 76), KSOS3
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_KSOS3_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_KSOS3_GPIO_PIN_MASK (1U << 21U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_KSOS3_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_KSOS3_PIN 21U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_KSOS3_PIN_MASK (1U << 21U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PIO0_22 (number 78), KSOE
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_KSOE_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_KSOE_GPIO_PIN_MASK (1U << 22U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_KSOE_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_KSOE_PIN 22U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_KSOE_PIN_MASK (1U << 22U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PIO0_24 (number 70), SPI_SCLK
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SPI_SCLK_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_SPI_SCLK_GPIO_PIN_MASK (1U << 24U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_SPI_SCLK_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SPI_SCLK_PIN 24U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SPI_SCLK_PIN_MASK (1U << 24U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PIO0_23 (number 20), SPI_CS
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SPI_CS_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_SPI_CS_GPIO_PIN_MASK (1U << 23U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_SPI_CS_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SPI_CS_PIN 23U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SPI_CS_PIN_MASK (1U << 23U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PIO0_28 (number 66), LCD_EN
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_LCD_EN_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_LCD_EN_GPIO_PIN_MASK (1U << 28U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_LCD_EN_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_LCD_EN_PIN 28U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_LCD_EN_PIN_MASK (1U << 28U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PIO0_25 (number 79), SPI_MOSI
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SPI_MOSI_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_SPI_MOSI_GPIO_PIN_MASK (1U << 25U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_SPI_MOSI_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SPI_MOSI_PIN 25U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SPI_MOSI_PIN_MASK (1U << 25U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PIO0_26 (number 60), SPI_MISO
  @{ */

