EI2030/Archer/firmware/ec/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SPI_MISO_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_SPI_MISO_GPIO_PIN_MASK (1U << 26U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_SPI_MISO_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SPI_MISO_PIN 26U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SPI_MISO_PIN_MASK (1U << 26U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PIO1_0 (number 11), USB_OTG_ID
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_USB_OTG_ID_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_USB_OTG_ID_GPIO_PIN_MASK (1U << 0U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_USB_OTG_ID_PORT 1U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_USB_OTG_ID_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_USB_OTG_ID_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PIO1_1 (number 59), EC_INT
  @{ */
#define BOARD_INITPINS_EC_INT_PORT 1U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_EC_INT_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_EC_INT_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PIO1_2 (number 61), PWR_EN
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_PWR_EN_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_PWR_EN_GPIO_PIN_MASK (1U << 2U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_PWR_EN_PORT 1U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_PWR_EN_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_PWR_EN_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PIO1_3 (number 62), ARM_EN
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_ARM_EN_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_ARM_EN_GPIO_PIN_MASK (1U << 3U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_ARM_EN_PORT 1U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_ARM_EN_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_ARM_EN_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PIO0_29 (number 92), UART_RX
  @{ */
#define BOARD_INITPINS_UART_RX_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_UART_RX_PIN 29U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_UART_RX_PIN_MASK (1U << 29U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PIO0_30 (number 94), UART_TX
  @{ */
#define BOARD_INITPINS_UART_TX_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_UART_TX_PIN 30U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_UART_TX_PIN_MASK (1U << 30U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void); /* Function assigned for the Cortex-M33 (Core #0) */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
